[Killed] PublicVisibility
Console/Commands/ImportOfferCommand.php:15:5
 
     protected $description = 'Import offers';
 
-    public function handle(OfferImporter $offerImporter): int
+    protected function handle(OfferImporter $offerImporter): int
     {
         if ($offerImporter->import()) {
killedBy: Tests\Unit\Commands\ImportOfferCommandTest::testHandleFailure
statusReason: 1) Tests\Unit\Commands\ImportOfferCommandTest::testHandleFailure
BadMethodCallException: Method App\Console\Commands\ImportOfferCommand::handle does not exist.

/var/www/html/vendor/laravel/framework/src/Illuminate/Macroable/Traits/Macroable.php:112
/var/www/html/vendor/laravel/framework/src/Illuminate/Container/BoundMethod.php:36
/var/www/html/vendor/laravel/framework/src/Illuminate/Container/Uti

[Killed] IfNegation
Console/Commands/ImportOfferCommand.php:17:9
 
     public function handle(OfferImporter $offerImporter): int
     {
-        if ($offerImporter->import()) {
-            $this->info(__('Successfully imported offers.'));
-
-            return CommandAlias::SUCCESS;
-        }
+        if (!$offerImporter->import()) {
 
         $this->error(__('Failed to import offers.'));
killedBy: Tests\Unit\Commands\ImportOfferCommandTest::testHandleFailure
statusReason: 1) Tests\Unit\Commands\ImportOfferCommandTest::testHandleFailure
Expected status code 1 but received 0.
Failed asserting that 0 matches expected 1.

/var/www/html/vendor/laravel/framework/src/Illuminate/Testing/PendingCommand.php:309
/var/www/html/vendor/laravel/framework/src/Illuminate/Testing/PendingCommand.php:484
/var/www/html/tests/Unit/Commands/ImportOfferCommandTest.php:23
/var/www/html/ven

[Killed] MethodCallRemoval
Console/Commands/ImportOfferCommand.php:18:13
     public function handle(OfferImporter $offerImporter): int
     {
         if ($offerImporter->import()) {
-            $this->info(__('Successfully imported offers.'));
+            
 
             return CommandAlias::SUCCESS;
killedBy: Tests\Unit\Commands\ImportOfferCommandTest::testHandleSuccess
statusReason: 1) Tests\Unit\Commands\ImportOfferCommandTest::testHandleSuccess
Output "Successfully imported offers." was not printed.

/var/www/html/vendor/laravel/framework/src/Illuminate/Testing/PendingCommand.php:350
/var/www/html/vendor/laravel/framework/src/Illuminate/Testing/PendingCommand.php:320
/var/www/html/vendor/laravel/framework/src/Illuminate/Testing/PendingCommand.php:484
/var/www/html/tests/Uni

[Killed] MethodCallRemoval
Console/Commands/ImportOfferCommand.php:23:9
             return CommandAlias::SUCCESS;
         }
 
-        $this->error(__('Failed to import offers.'));
+        
 
         return CommandAlias::FAILURE;
killedBy: Tests\Unit\Commands\ImportOfferCommandTest::testHandleFailure
statusReason: 1) Tests\Unit\Commands\ImportOfferCommandTest::testHandleFailure
Output "Failed to import offers." was not printed.

/var/www/html/vendor/laravel/framework/src/Illuminate/Testing/PendingCommand.php:350
/var/www/html/vendor/laravel/framework/src/Illuminate/Testing/PendingCommand.php:320
/var/www/html/vendor/laravel/framework/src/Illuminate/Testing/PendingCommand.php:484
/var/www/html/tests/Unit/Com
