[Killed] PublicVisibility
Console/Commands/ImportShopCommand.php:15:5
 
     protected $description = 'Import shops';
 
-    public function handle(ShopImporter $shopImporter): int
+    protected function handle(ShopImporter $shopImporter): int
     {
         if ($shopImporter->import()) {
killedBy: Tests\Unit\Commands\ImportShopCommandTest::testHandleFailure
statusReason: 1) Tests\Unit\Commands\ImportShopCommandTest::testHandleFailure
BadMethodCallException: Method App\Console\Commands\ImportShopCommand::handle does not exist.

/var/www/html/vendor/laravel/framework/src/Illuminate/Macroable/Traits/Macroable.php:112
/var/www/html/vendor/laravel/framework/src/Illuminate/Container/BoundMethod.php:36
/var/www/html/vendor/laravel/framework/src/Illuminate/Container/Util.

[Killed] IfNegation
Console/Commands/ImportShopCommand.php:17:9
 
     public function handle(ShopImporter $shopImporter): int
     {
-        if ($shopImporter->import()) {
-            $this->info(__('Successfully imported shops.'));
-
-            return CommandAlias::SUCCESS;
-        }
+        if (!$shopImporter->import()) {
 
         $this->error(__('Failed to import shops.'));
killedBy: Tests\Unit\Commands\ImportShopCommandTest::testHandleFailure
statusReason: 1) Tests\Unit\Commands\ImportShopCommandTest::testHandleFailure
Expected status code 1 but received 0.
Failed asserting that 0 matches expected 1.

/var/www/html/vendor/laravel/framework/src/Illuminate/Testing/PendingCommand.php:309
/var/www/html/vendor/laravel/framework/src/Illuminate/Testing/PendingCommand.php:484
/var/www/html/tests/Unit/Commands/ImportShopCommandTest.php:23
/var/www/html/vendo

[Killed] MethodCallRemoval
Console/Commands/ImportShopCommand.php:18:13
     public function handle(ShopImporter $shopImporter): int
     {
         if ($shopImporter->import()) {
-            $this->info(__('Successfully imported shops.'));
+            
 
             return CommandAlias::SUCCESS;
killedBy: Tests\Unit\Commands\ImportShopCommandTest::testHandleSuccess
statusReason: 1) Tests\Unit\Commands\ImportShopCommandTest::testHandleSuccess
Output "Successfully imported shops." was not printed.

/var/www/html/vendor/laravel/framework/src/Illuminate/Testing/PendingCommand.php:350
/var/www/html/vendor/laravel/framework/src/Illuminate/Testing/PendingCommand.php:320
/var/www/html/vendor/laravel/framework/src/Illuminate/Testing/PendingCommand.php:484
/var/www/html/tests/Unit/

[Killed] MethodCallRemoval
Console/Commands/ImportShopCommand.php:23:9
             return CommandAlias::SUCCESS;
         }
 
-        $this->error(__('Failed to import shops.'));
+        
 
         return CommandAlias::FAILURE;
killedBy: Tests\Unit\Commands\ImportShopCommandTest::testHandleFailure
statusReason: 1) Tests\Unit\Commands\ImportShopCommandTest::testHandleFailure
Output "Failed to import shops." was not printed.

/var/www/html/vendor/laravel/framework/src/Illuminate/Testing/PendingCommand.php:350
/var/www/html/vendor/laravel/framework/src/Illuminate/Testing/PendingCommand.php:320
/var/www/html/vendor/laravel/framework/src/Illuminate/Testing/PendingCommand.php:484
/var/www/html/tests/Unit/Comma
