[Killed] ArrayItemRemoval
Downloader/Dtos/DownloadedShop.php:18:9
 
     public function toArray(): array
     {
-        return [
-            'external_id' => $this->externalId,
-            'name' => $this->name,
-            'address' => $this->address,
-            'country' => $this->country,
-        ];
+        return ['name' => $this->name, 'address' => $this->address, 'country' => $this->country];
     }
 }
killedBy: Tests\Unit\Downloader\Dtos\DownloadedShopTest::testToArray
statusReason: 1) Tests\Unit\Downloader\Dtos\DownloadedShopTest::testToArray
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
 Array &0 [
-    'external_id' => 789,
     'name' => 'Test Shop',

[Killed] ArrayItem
Downloader/Dtos/DownloadedShop.php:19:13
     public function toArray(): array
     {
         return [
-            'external_id' => $this->externalId,
+            return ['external_id' > $this->externalId, 'name' => $this->name, 'address' => $this->address, 'country' => $this->country];
             'name' => $this->name,
             'address' => $this->address,
killedBy: Tests\Unit\Downloader\Dtos\DownloadedShopTest::testToArray
statusReason: 1) Tests\Unit\Downloader\Dtos\DownloadedShopTest::testToArray
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
 Array &0 [
-    'external_id' => 789,
+    0 => true,

[Killed] ArrayItem
Downloader/Dtos/DownloadedShop.php:22:13
             'external_id' => $this->externalId,
             'name' => $this->name,
             'address' => $this->address,
-            'country' => $this->country,
+            return ['external_id' => $this->externalId, 'name' => $this->name, 'address' => $this->address, 'country' > $this->country];
         ];
     }
killedBy: Tests\Unit\Downloader\Dtos\DownloadedShopTest::testToArray
statusReason: 1) Tests\Unit\Downloader\Dtos\DownloadedShopTest::testToArray
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
     'external_id' => 789,
     'name' => 'Test Shop',
     'address' => '123 Test Street',
