[Killed] PublicVisibility
Downloader/OfferDownloader.php:11:5
 {
     public function __construct(private readonly JsonDownloadStrategy $jsonDownloadStrategy) {}
 
-    public function download(): array
+    protected function download(): array
     {
         return $this->jsonDownloadStrategy->download('api/v1/offers.json');
killedBy: Tests\Unit\Downloader\OfferDownloaderTest::testDownload
statusReason: 1) Tests\Unit\Downloader\OfferDownloaderTest::testDownload
Error: Call to protected method App\Downloader\OfferDownloader::download() from scope Tests\Unit\Downloader\OfferDownloaderTest

/var/www/html/tests/Unit/Downloader/OfferDownloaderTest.php:24
/var/www/html/vendor/laravel/framework/src/Illuminate/Foundation/Testing/TestCase.php:61

ERRORS!
Tests: 1, Assertions: 1, Errors: 1.
