[Killed] NewObject
Downloader/Parsers/OfferDownloaderParser.php:14:13
     public function parse(array $data): array
     {
         return array_map(static function (array $data) {
-            return new DownloadedOffer(
-                Arr::get($data, 'id'),
-                Arr::get($data, 'shop_id'),
-                Arr::get($data, 'product'),
-                Arr::get($data, 'price'),
-                Arr::get($data, 'currency'),
-                Arr::get($data, 'description'),
-            );
+            new DownloadedOffer(Arr::get($data, 'id'), Arr::get($data, 'shop_id'), Arr::get($data, 'product'), Arr::get($data, 'price'), Arr::get($data, 'currency'), Arr::get($data, 'description'));
+            return null;
         }, $data);
     }
killedBy: Tests\Unit\Downloader\Parsers\OfferDownloaderParserTest::testParse
statusReason: 1) Tests\Unit\Downloader\Parsers\OfferDownloaderParserTest::testParse
Failed asserting that null is an instance of class App\Downloader\Dtos\DownloadedOffer.

/var/www/html/tests/Unit/Downloader/Parsers/OfferDownloaderParserTest.php:43
/var/www/html/vendor/laravel/framework/src/Illuminate/Collections/Traits/EnumeratesValues.php:240
/var/www/html/tests/Unit/Downloader/Parsers/OfferDownloaderParserT
