[Killed] NewObject
Downloader/Parsers/ShopDownloaderParser.php:14:13
     public function parse(array $data): array
     {
         return array_map(static function (array $data) {
-            return new DownloadedShop(
-                Arr::get($data, 'id'),
-                Arr::get($data, 'name'),
-                Arr::get($data, 'address'),
-                Arr::get($data, 'country'),
-            );
+            new DownloadedShop(Arr::get($data, 'id'), Arr::get($data, 'name'), Arr::get($data, 'address'), Arr::get($data, 'country'));
+            return null;
         }, $data);
     }
killedBy: Tests\Unit\Downloader\Parsers\ShopDownloaderParserTest::testParse
statusReason: 1) Tests\Unit\Downloader\Parsers\ShopDownloaderParserTest::testParse
Failed asserting that null is an instance of class App\Downloader\Dtos\DownloadedShop.

/var/www/html/tests/Unit/Downloader/Parsers/ShopDownloaderParserTest.php:39
/var/www/html/vendor/laravel/framework/src/Illuminate/Collections/Traits/EnumeratesValues.php:240
/var/www/html/tests/Unit/Downloader/Parsers/ShopDownloaderParserTest.
