[Killed] UnwrapArrayMerge
Downloader/ShopDownloader.php:17:9
 
     public function download(): array
     {
-        return array_merge(
-            $this->jsonDownloadStrategy->download('api/v1/shops.json'),
-            $this->csvDownloadStrategy->download('shops.csv')
-        );
+        return $this->csvDownloadStrategy->download('shops.csv');
     }
 }
killedBy: Tests\Unit\Downloader\ShopDownloaderTest::testDownload
statusReason: 1) Tests\Unit\Downloader\ShopDownloaderTest::testDownload
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
 Array &0 [
-    'foo' => 'bar',
     'baz' => 'fooBar',

[Killed] UnwrapArrayMerge
Downloader/ShopDownloader.php:17:9
 
     public function download(): array
     {
-        return array_merge(
-            $this->jsonDownloadStrategy->download('api/v1/shops.json'),
-            $this->csvDownloadStrategy->download('shops.csv')
-        );
+        return $this->jsonDownloadStrategy->download('api/v1/shops.json');
     }
 }
killedBy: Tests\Unit\Downloader\ShopDownloaderTest::testDownload
statusReason: 1) Tests\Unit\Downloader\ShopDownloaderTest::testDownload
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
 Array &0 [
     'foo' => 'bar',
-    'baz' => 'fooBar',
