[Killed] MethodCallRemoval
Downloader/Strategies/CsvDownloadStrategy.php:20:13
             $response = $this->client->get($url);
 
             $csv = Reader::createFromString($response->getBody()->getContents());
-            $csv->setHeaderOffset(0);
+            
 
             return iterator_to_array($csv, false);
killedBy: Tests\Unit\Downloader\Strategies\CsvDownloadStrategyTest::testSuccessDownload
statusReason: 1) Tests\Unit\Downloader\Strategies\CsvDownloadStrategyTest::testSuccessDownload
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
 Array &0 [
     0 => Array &1 [
-        'id' => '1',

[Killed] IncrementInteger
Downloader/Strategies/CsvDownloadStrategy.php:20:13
             $response = $this->client->get($url);
 
             $csv = Reader::createFromString($response->getBody()->getContents());
-            $csv->setHeaderOffset(0);
+            $csv->setHeaderOffset(1);
 
             return iterator_to_array($csv, false);
killedBy: Tests\Unit\Downloader\Strategies\CsvDownloadStrategyTest::testSuccessDownload
statusReason: 1) Tests\Unit\Downloader\Strategies\CsvDownloadStrategyTest::testSuccessDownload
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
 Array &0 [
     0 => Array &1 [
-        'id' => '1',

[Killed] FalseValue
Downloader/Strategies/CsvDownloadStrategy.php:22:13
             $csv = Reader::createFromString($response->getBody()->getContents());
             $csv->setHeaderOffset(0);
 
-            return iterator_to_array($csv, false);
+            return iterator_to_array($csv, true);
         } catch (RequestException $e) {
             throw new \RuntimeException('Request Error: '.$e->getMessage());
killedBy: Tests\Unit\Downloader\Strategies\CsvDownloadStrategyTest::testSuccessDownload
statusReason: 1) Tests\Unit\Downloader\Strategies\CsvDownloadStrategyTest::testSuccessDownload
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
 Array &0 [
-    0 => Array &1 [
+    1 => Array &1 [

[Killed] ConcatOperandRemoval
Downloader/Strategies/CsvDownloadStrategy.php:24:13
 
             return iterator_to_array($csv, false);
         } catch (RequestException $e) {
-            throw new \RuntimeException('Request Error: '.$e->getMessage());
+            throw new \RuntimeException('Request Error: ');
         }
     }
killedBy: Tests\Unit\Downloader\Strategies\CsvDownloadStrategyTest::testCatchRequestExceptionAndThrowRuntimeException
statusReason: 1) Tests\Unit\Downloader\Strategies\CsvDownloadStrategyTest::testCatchRequestExceptionAndThrowRuntimeException
Failed asserting that exception message 'Request Error: ' contains 'Request Error: Error Communicating with Server'.

/var/www/html/vendor/laravel/framework/src/Illuminate/Foundation/Testing/TestCase.php:61

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] Concat
Downloader/Strategies/CsvDownloadStrategy.php:24:13
 
             return iterator_to_array($csv, false);
         } catch (RequestException $e) {
-            throw new \RuntimeException('Request Error: '.$e->getMessage());
+            throw new \RuntimeException($e->getMessage() . 'Request Error: ');
         }
     }
killedBy: Tests\Unit\Downloader\Strategies\CsvDownloadStrategyTest::testCatchRequestExceptionAndThrowRuntimeException
statusReason: 1) Tests\Unit\Downloader\Strategies\CsvDownloadStrategyTest::testCatchRequestExceptionAndThrowRuntimeException
Failed asserting that exception message 'Error Communicating with ServerRequest Error: ' contains 'Request Error: Error Communicating with Server'.

/var/www/html/vendor/laravel/framework/src/Illuminate/Foundation/Testing/TestCase.php:61

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.
