[Killed] IfNegation
Controllers/Api/V1/OfferController.php:22:9
         $perPage = $request->input('perPage');
 
         $inputBeforeSubstituteBinding = $route->originalParameter('shopIdOrShopCountryCode');
-        if (is_numeric($inputBeforeSubstituteBinding)) {
-            $orderedCollectionByPrice = $shop->offers()->orderBy('price')->paginate(
-                perPage: $perPage,
-                page: $page
-            );
-
-            return new Collection($orderedCollectionByPrice);
-        }
+        if (!is_numeric($inputBeforeSubstituteBinding)) {
 
         $collectionWithShop = $shop->offers()->with('shop')->paginate(
killedBy: Tests\Feature\OfferControllerTest::testInputIsNumericReturnOrderedOfferCollectionByPriceAsc
statusReason: 1) Tests\Feature\OfferControllerTest::testInputIsNumericReturnOrderedOfferCollectionByPriceAsc
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
-    0 => 8998366
-    1 => 76
