[Killed] MethodCallRemoval
Importer/OfferImporter.php:29:9
         $downloadedOffers = $this->offerDownloader->download();
         $parsedDownloadedOffers = $this->offerDownloaderParser->parse($downloadedOffers);
 
-        DB::transaction(function () use ($parsedDownloadedOffers) {
-            /* @var DownloadedOffer $parsedDownloadedOffer */
-            foreach ($parsedDownloadedOffers as $parsedDownloadedOffer) {
-                $this->upsert($parsedDownloadedOffer);
-            }
-        });
+        
 
         return true;
killedBy: Tests\Unit\Importers\OfferImporterTest::testImportWithUpdateOffer
statusReason: 1) Tests\Unit\Importers\OfferImporterTest::testImportWithUpdateOffer
Mockery\Exception\InvalidCountException: Method transaction(<Any Arguments>) from Mockery_2_Illuminate_Database_DatabaseManager should be called
 exactly 1 times but called 0 times.

/var/www/html/vendor/mockery/mockery/library/Mockery/CountValidator/Exact.php:32
/var/www/html/vendor/mockery/mockery/library/Mockery/Expectation.ph

[Killed] Foreach_
Importer/OfferImporter.php:31:13
 
         DB::transaction(function () use ($parsedDownloadedOffers) {
             /* @var DownloadedOffer $parsedDownloadedOffer */
-            foreach ($parsedDownloadedOffers as $parsedDownloadedOffer) {
-                $this->upsert($parsedDownloadedOffer);
-            }
+            foreach ([] as $parsedDownloadedOffer) {
         });
 
killedBy: Tests\Unit\Importers\OfferImporterTest::testImportWithoutShopWriteWarningLog
statusReason: 1) Tests\Unit\Importers\OfferImporterTest::testImportWithoutShopWriteWarningLog
Mockery\Exception\InvalidCountException: Method warning('Shop not found for offer.', ['external_shop_id' => 456]) from Mockery_3_Illuminate_Log_LogManager should be called
 exactly 1 times but called 0 times.

/var/www/html/vendor/mockery/mockery/library/Mockery/CountValidator/Exact.php:32
/var/www/html/vendor/mockery/

[Killed] MethodCallRemoval
Importer/OfferImporter.php:32:17
         DB::transaction(function () use ($parsedDownloadedOffers) {
             /* @var DownloadedOffer $parsedDownloadedOffer */
             foreach ($parsedDownloadedOffers as $parsedDownloadedOffer) {
-                $this->upsert($parsedDownloadedOffer);
+                
             }
         });
killedBy: Tests\Unit\Importers\OfferImporterTest::testImportWithoutShopWriteWarningLog
statusReason: 1) Tests\Unit\Importers\OfferImporterTest::testImportWithoutShopWriteWarningLog
Mockery\Exception\InvalidCountException: Method warning('Shop not found for offer.', ['external_shop_id' => 456]) from Mockery_3_Illuminate_Log_LogManager should be called
 exactly 1 times but called 0 times.

/var/www/html/vendor/mockery/mockery/library/Mockery/CountValidator/Exact.php:32
/var/www/html/vendor/mockery/

[Killed] MethodCallRemoval
Importer/OfferImporter.php:42:13
     private function upsert(DownloadedOffer $downloadedOffer): void
     {
         if ($offer = $this->offerService->findByExternalId($downloadedOffer->externalId)) {
-            $this->offerService->update($offer, $downloadedOffer->toArray());
+            
 
             $this->logger->info(__('Offer updated.'), ['external_id' => $downloadedOffer->externalId]);
killedBy: Tests\Unit\Importers\OfferImporterTest::testImportWithUpdateOffer
statusReason: 1) Tests\Unit\Importers\OfferImporterTest::testImportWithUpdateOffer
 exactly 1 times but called 0 times.

/var/www/html/vendor/mockery/mockery/library/Mockery/CountValidator/Exact.php:32
/var/www/html/vendor/mockery/mockery/library/Mockery/Expectation.php:739
/var/www/html/vendor/mockery/mockery/library/Mockery/ExpectationDirector.php:202
/var/www/html/vendor/mockery/mockery/library/Mockery/Conta

[Killed] MethodCallRemoval
Importer/OfferImporter.php:44:13
         if ($offer = $this->offerService->findByExternalId($downloadedOffer->externalId)) {
             $this->offerService->update($offer, $downloadedOffer->toArray());
 
-            $this->logger->info(__('Offer updated.'), ['external_id' => $downloadedOffer->externalId]);
+            
         } elseif ($shop = $this->shopService->findByExternalId($downloadedOffer->externalShopId)) {
             $this->offerService->create($shop, $downloadedOffer->toArray());
killedBy: Tests\Unit\Importers\OfferImporterTest::testImportWithUpdateOffer
statusReason: 1) Tests\Unit\Importers\OfferImporterTest::testImportWithUpdateOffer
Mockery\Exception\InvalidCountException: Method info('Offer updated.', ['external_id' => 123]) from Mockery_3_Illuminate_Log_LogManager should be called
 exactly 1 times but called 0 times.

/var/www/html/vendor/mockery/mockery/library/Mockery/CountValidator/Exact.php:32
/var/www/html/vendor/mockery/mockery/library/Mockery/Expect

[Killed] MethodCallRemoval
Importer/OfferImporter.php:46:13
 
             $this->logger->info(__('Offer updated.'), ['external_id' => $downloadedOffer->externalId]);
         } elseif ($shop = $this->shopService->findByExternalId($downloadedOffer->externalShopId)) {
-            $this->offerService->create($shop, $downloadedOffer->toArray());
+            
 
             $this->logger->info(__('Offer created.'), ['external_id' => $downloadedOffer->externalId]);
killedBy: Tests\Unit\Importers\OfferImporterTest::testImportWithCreateOffer
statusReason: 1) Tests\Unit\Importers\OfferImporterTest::testImportWithCreateOffer
 exactly 1 times but called 0 times.

/var/www/html/vendor/mockery/mockery/library/Mockery/CountValidator/Exact.php:32
/var/www/html/vendor/mockery/mockery/library/Mockery/Expectation.php:739
/var/www/html/vendor/mockery/mockery/library/Mockery/ExpectationDirector.php:202
/var/www/html/vendor/mockery/mockery/library/Mockery/Conta

[Killed] MethodCallRemoval
Importer/OfferImporter.php:48:13
         } elseif ($shop = $this->shopService->findByExternalId($downloadedOffer->externalShopId)) {
             $this->offerService->create($shop, $downloadedOffer->toArray());
 
-            $this->logger->info(__('Offer created.'), ['external_id' => $downloadedOffer->externalId]);
+            
         } else {
             $this->logger->warning(__('Shop not found for offer.'), ['external_shop_id' => $downloadedOffer->externalShopId]);
killedBy: Tests\Unit\Importers\OfferImporterTest::testImportWithCreateOffer
statusReason: 1) Tests\Unit\Importers\OfferImporterTest::testImportWithCreateOffer
Mockery\Exception\InvalidCountException: Method info('Offer created.', ['external_id' => 123]) from Mockery_3_Illuminate_Log_LogManager should be called
 exactly 1 times but called 0 times.

/var/www/html/vendor/mockery/mockery/library/Mockery/CountValidator/Exact.php:32
/var/www/html/vendor/mockery/mockery/library/Mockery/Expect

[Killed] ArrayItem
Importer/OfferImporter.php:48:13
         } elseif ($shop = $this->shopService->findByExternalId($downloadedOffer->externalShopId)) {
             $this->offerService->create($shop, $downloadedOffer->toArray());
 
-            $this->logger->info(__('Offer created.'), ['external_id' => $downloadedOffer->externalId]);
+            $this->logger->info(__('Offer created.'), ['external_id' > $downloadedOffer->externalId]);
         } else {
             $this->logger->warning(__('Shop not found for offer.'), ['external_shop_id' => $downloadedOffer->externalShopId]);
killedBy: Tests\Unit\Importers\OfferImporterTest::testImportWithCreateOffer
statusReason: 1) Tests\Unit\Importers\OfferImporterTest::testImportWithCreateOffer
Mockery\Exception\NoMatchingExpectationException: No matching handler found for Mockery_3_Illuminate_Log_LogManager::info('Offer created.', [0 => true]). Either the method was unexpected or its arguments matched no expected argument list for this method



/var/www/html/vendor/mockery/mockery/library/Mockery/ExpectationDirector.p

[Killed] MethodCallRemoval
Importer/OfferImporter.php:50:13
 
             $this->logger->info(__('Offer created.'), ['external_id' => $downloadedOffer->externalId]);
         } else {
-            $this->logger->warning(__('Shop not found for offer.'), ['external_shop_id' => $downloadedOffer->externalShopId]);
+            
         }
     }
killedBy: Tests\Unit\Importers\OfferImporterTest::testImportWithoutShopWriteWarningLog
statusReason: 1) Tests\Unit\Importers\OfferImporterTest::testImportWithoutShopWriteWarningLog
Mockery\Exception\InvalidCountException: Method warning('Shop not found for offer.', ['external_shop_id' => 456]) from Mockery_3_Illuminate_Log_LogManager should be called
 exactly 1 times but called 0 times.

/var/www/html/vendor/mockery/mockery/library/Mockery/CountValidator/Exact.php:32
/var/www/html/vendor/mockery/
