[Killed] MethodCallRemoval
Importer/ShopImporter.php:27:9
         $downloadedShops = $this->shopDownloader->download();
         $parsedDownloadedShops = $this->shopDownloaderParser->parse($downloadedShops);
 
-        DB::transaction(function () use ($parsedDownloadedShops) {
-            /* @var DownloadedShop $parsedDownloadedShop */
-            foreach ($parsedDownloadedShops as $parsedDownloadedShop) {
-                $this->upsert($parsedDownloadedShop);
-            }
-        });
+        
 
         return true;
killedBy: Tests\Unit\Importers\ShopImporterTest::testImportWithCreateShop
statusReason: 1) Tests\Unit\Importers\ShopImporterTest::testImportWithCreateShop
Mockery\Exception\InvalidCountException: Method transaction(<Any Arguments>) from Mockery_2_Illuminate_Database_DatabaseManager should be called
 exactly 1 times but called 0 times.

/var/www/html/vendor/mockery/mockery/library/Mockery/CountValidator/Exact.php:32
/var/www/html/vendor/mockery/mockery/library/Mockery/Expectation.php:

[Killed] Foreach_
Importer/ShopImporter.php:29:13
 
         DB::transaction(function () use ($parsedDownloadedShops) {
             /* @var DownloadedShop $parsedDownloadedShop */
-            foreach ($parsedDownloadedShops as $parsedDownloadedShop) {
-                $this->upsert($parsedDownloadedShop);
-            }
+            foreach ([] as $parsedDownloadedShop) {
         });
 
killedBy: Tests\Unit\Importers\ShopImporterTest::testImportWithCreateShop
statusReason: 1) Tests\Unit\Importers\ShopImporterTest::testImportWithCreateShop
Mockery\Exception\InvalidCountException: Method info('Shop created.', ['external_id' => 789]) from Mockery_3_Illuminate_Log_LogManager should be called
 exactly 1 times but called 0 times.

/var/www/html/vendor/mockery/mockery/library/Mockery/CountValidator/Exact.php:32
/var/www/html/vendor/mockery/mockery/library/Mockery/Expectati

[Killed] MethodCallRemoval
Importer/ShopImporter.php:30:17
         DB::transaction(function () use ($parsedDownloadedShops) {
             /* @var DownloadedShop $parsedDownloadedShop */
             foreach ($parsedDownloadedShops as $parsedDownloadedShop) {
-                $this->upsert($parsedDownloadedShop);
+                
             }
         });
killedBy: Tests\Unit\Importers\ShopImporterTest::testImportWithCreateShop
statusReason: 1) Tests\Unit\Importers\ShopImporterTest::testImportWithCreateShop
Mockery\Exception\InvalidCountException: Method info('Shop created.', ['external_id' => 789]) from Mockery_3_Illuminate_Log_LogManager should be called
 exactly 1 times but called 0 times.

/var/www/html/vendor/mockery/mockery/library/Mockery/CountValidator/Exact.php:32
/var/www/html/vendor/mockery/mockery/library/Mockery/Expectati

[Killed] MethodCallRemoval
Importer/ShopImporter.php:40:13
     private function upsert(DownloadedShop $downloadedShop): void
     {
         if ($shop = $this->shopService->findByExternalId($downloadedShop->externalId)) {
-            $this->shopService->update($shop, $downloadedShop->toArray());
+            
             $this->logger->info(__('Shop updated.'), ['external_id' => $downloadedShop->externalId]);
         } else {
killedBy: Tests\Unit\Importers\ShopImporterTest::testImportWithUpdateShop
statusReason: 1) Tests\Unit\Importers\ShopImporterTest::testImportWithUpdateShop
Mockery\Exception\InvalidCountException: Method update(object(App\Models\Shop), ['external_id' => 789, 'name' => 'Test Shop', 'address' => '789 Test Street', 'country' => 'UK']) from Mockery_6_App_Services_Contracts_ShopService should be called
 exactly 1 times but called 0 times.

/var/www/html/vendor/mockery/mockery/library/Mocke

[Killed] MethodCallRemoval
Importer/ShopImporter.php:41:13
     {
         if ($shop = $this->shopService->findByExternalId($downloadedShop->externalId)) {
             $this->shopService->update($shop, $downloadedShop->toArray());
-            $this->logger->info(__('Shop updated.'), ['external_id' => $downloadedShop->externalId]);
+            
         } else {
             $this->shopService->create($downloadedShop->toArray());
killedBy: Tests\Unit\Importers\ShopImporterTest::testImportWithUpdateShop
statusReason: 1) Tests\Unit\Importers\ShopImporterTest::testImportWithUpdateShop
Mockery\Exception\InvalidCountException: Method info('Shop updated.', ['external_id' => 789]) from Mockery_3_Illuminate_Log_LogManager should be called
 exactly 1 times but called 0 times.

/var/www/html/vendor/mockery/mockery/library/Mockery/CountValidator/Exact.php:32
/var/www/html/vendor/mockery/mockery/library/Mockery/Expectati

[Killed] ArrayItemRemoval
Importer/ShopImporter.php:41:13
     {
         if ($shop = $this->shopService->findByExternalId($downloadedShop->externalId)) {
             $this->shopService->update($shop, $downloadedShop->toArray());
-            $this->logger->info(__('Shop updated.'), ['external_id' => $downloadedShop->externalId]);
+            $this->logger->info(__('Shop updated.'), []);
         } else {
             $this->shopService->create($downloadedShop->toArray());
killedBy: Tests\Unit\Importers\ShopImporterTest::testImportWithUpdateShop
statusReason: 1) Tests\Unit\Importers\ShopImporterTest::testImportWithUpdateShop
Mockery\Exception\NoMatchingExpectationException: No matching handler found for Mockery_3_Illuminate_Log_LogManager::info('Shop updated.', []). Either the method was unexpected or its arguments matched no expected argument list for this method



/var/www/html/vendor/mockery/mockery/library/Mockery/ExpectationDirector.php:90
/var/w

[Killed] MethodCallRemoval
Importer/ShopImporter.php:43:13
             $this->shopService->update($shop, $downloadedShop->toArray());
             $this->logger->info(__('Shop updated.'), ['external_id' => $downloadedShop->externalId]);
         } else {
-            $this->shopService->create($downloadedShop->toArray());
+            
             $this->logger->info(__('Shop created.'), ['external_id' => $downloadedShop->externalId]);
         }
killedBy: Tests\Unit\Importers\ShopImporterTest::testImportWithCreateShop
statusReason: 1) Tests\Unit\Importers\ShopImporterTest::testImportWithCreateShop
Mockery\Exception\InvalidCountException: Method create(['external_id' => 789, 'name' => 'Test Shop', 'address' => '789 Test Street', 'country' => 'UK']) from Mockery_6_App_Services_Contracts_ShopService should be called
 exactly 1 times but called 0 times.

/var/www/html/vendor/mockery/mockery/library/Mockery/CountValidator/Exact.p

[Killed] MethodCallRemoval
Importer/ShopImporter.php:44:13
             $this->logger->info(__('Shop updated.'), ['external_id' => $downloadedShop->externalId]);
         } else {
             $this->shopService->create($downloadedShop->toArray());
-            $this->logger->info(__('Shop created.'), ['external_id' => $downloadedShop->externalId]);
+            
         }
     }
killedBy: Tests\Unit\Importers\ShopImporterTest::testImportWithCreateShop
statusReason: 1) Tests\Unit\Importers\ShopImporterTest::testImportWithCreateShop
Mockery\Exception\InvalidCountException: Method info('Shop created.', ['external_id' => 789]) from Mockery_3_Illuminate_Log_LogManager should be called
 exactly 1 times but called 0 times.

/var/www/html/vendor/mockery/mockery/library/Mockery/CountValidator/Exact.php:32
/var/www/html/vendor/mockery/mockery/library/Mockery/Expectati

[Killed] ArrayItemRemoval
Importer/ShopImporter.php:44:13
             $this->logger->info(__('Shop updated.'), ['external_id' => $downloadedShop->externalId]);
         } else {
             $this->shopService->create($downloadedShop->toArray());
-            $this->logger->info(__('Shop created.'), ['external_id' => $downloadedShop->externalId]);
+            $this->logger->info(__('Shop created.'), []);
         }
     }
killedBy: Tests\Unit\Importers\ShopImporterTest::testImportWithCreateShop
statusReason: 1) Tests\Unit\Importers\ShopImporterTest::testImportWithCreateShop
Mockery\Exception\NoMatchingExpectationException: No matching handler found for Mockery_3_Illuminate_Log_LogManager::info('Shop created.', []). Either the method was unexpected or its arguments matched no expected argument list for this method



/var/www/html/vendor/mockery/mockery/library/Mockery/ExpectationDirector.php:90
/var/w
