[Killed] PublicVisibility
Models/Offer.php:52:5
         'description',
     ];
 
-    public function shop(): BelongsTo
+    protected function shop(): BelongsTo
     {
         return $this->belongsTo(Shop::class);
killedBy: Tests\Unit\Resources\Offer\ModelTest::testToArrayWithShopLoaded
statusReason: 1) Tests\Feature\OfferControllerTest::testInputIsStringReturnOfferCollectionWithShop
Expected response status code [200] but received 500.
Failed asserting that 500 is identical to 200.

/var/www/html/vendor/laravel/framework/src/Illuminate/Testing/TestResponse.php:148
/var/www/html/vendor/laravel/framework/src/Illuminate/Testing/Concerns/AssertsStatusCodes.php:16
/var/www/html/tests/Feature/Offer

[Killed] ProtectedVisibility
Models/Offer.php:57:5
         return $this->belongsTo(Shop::class);
     }
 
-    protected function price(): Attribute
+    private function price(): Attribute
     {
         return Attribute::make(
killedBy: Tests\Unit\Models\OfferTest::testPriceAttribute
statusReason: 1) Tests\Unit\Models\OfferTest::testPriceAttribute
BadMethodCallException: Call to undefined method App\Models\Offer::price()

/var/www/html/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/html/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:36
/var/www/html/vendor/laravel/framework/src/Illuminate/Database/Eloquent/Model.php:2342
/var/w

[Killed] Division
Models/Offer.php:60:13
     protected function price(): Attribute
     {
         return Attribute::make(
-            get: static fn ($value) => $value / 100,
+            return Attribute::make(get: static fn($value) => $value * 100, set: static fn($value) => $value * 100);
             set: static fn ($value) => $value * 100
         );
killedBy: Tests\Unit\Models\OfferTest::testPriceAttribute
statusReason: 1) Tests\Unit\Models\OfferTest::testPriceAttribute
Failed asserting that 104000.0 matches expected 10.4.

/var/www/html/tests/Unit/Models/OfferTest.php:24
/var/www/html/vendor/laravel/framework/src/Illuminate/Foundation/Testing/TestCase.php:61

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] IncrementInteger
Models/Offer.php:60:13
     protected function price(): Attribute
     {
         return Attribute::make(
-            get: static fn ($value) => $value / 100,
+            return Attribute::make(get: static fn($value) => $value / 101, set: static fn($value) => $value * 100);
             set: static fn ($value) => $value * 100
         );
killedBy: Tests\Unit\Models\OfferTest::testPriceAttribute
statusReason: 1) Tests\Unit\Models\OfferTest::testPriceAttribute
Failed asserting that 10.297029702970297 matches expected 10.4.

/var/www/html/tests/Unit/Models/OfferTest.php:24
/var/www/html/vendor/laravel/framework/src/Illuminate/Foundation/Testing/TestCase.php:61

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] IncrementInteger
Models/Offer.php:61:13
     {
         return Attribute::make(
             get: static fn ($value) => $value / 100,
-            set: static fn ($value) => $value * 100
+            return Attribute::make(get: static fn($value) => $value / 100, set: static fn($value) => $value * 101);
         );
     }
killedBy: Tests\Unit\Models\OfferTest::testPriceAttribute
statusReason: 1) Tests\Unit\Models\OfferTest::testPriceAttribute
Failed asserting that 1050.4 matches expected 1040.

/var/www/html/tests/Unit/Models/OfferTest.php:23
/var/www/html/vendor/laravel/framework/src/Illuminate/Foundation/Testing/TestCase.php:61

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] DecrementInteger
Models/Offer.php:61:13
     {
         return Attribute::make(
             get: static fn ($value) => $value / 100,
-            set: static fn ($value) => $value * 100
+            return Attribute::make(get: static fn($value) => $value / 100, set: static fn($value) => $value * 99);
         );
     }
killedBy: Tests\Unit\Models\OfferTest::testPriceAttribute
statusReason: 1) Tests\Unit\Models\OfferTest::testPriceAttribute
Failed asserting that 1029.6000000000001 matches expected 1040.

/var/www/html/tests/Unit/Models/OfferTest.php:23
/var/www/html/vendor/laravel/framework/src/Illuminate/Foundation/Testing/TestCase.php:61

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
