[Killed] PublicVisibility
Models/Shop.php:47:5
         'country',
     ];
 
-    public function offers(): HasMany
+    protected function offers(): HasMany
     {
         return $this->hasMany(Offer::class);
killedBy: Tests\Feature\OfferControllerTest::testInputIsNumericReturnOrderedOfferCollectionByPriceAsc
statusReason: 1) Tests\Feature\OfferControllerTest::testInputIsNumericReturnOrderedOfferCollectionByPriceAsc
BadMethodCallException: Call to undefined method App\Models\Shop::offers()

/var/www/html/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/html/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:36
/var/www/html/vendor/laravel/framework/src/Illumi
