[Killed] MethodCallRemoval
Repositories/OfferRepository.php:17:9
 {
     public function __construct(Offer $model)
     {
-        parent::__construct($model);
+        
     }
 
killedBy: Tests\Unit\Repositories\OfferRepositoryTest::testFindBy
statusReason: 1) Tests\Unit\Repositories\OfferRepositoryTest::testFindByThrowModelNotFoundException
Failed asserting that exception of type "Error" matches expected exception "Illuminate\Database\Eloquent\ModelNotFoundException". Message was: "Typed property App\Repositories\Abstracts\AbstractRepository::$model must not be accessed before initialization" at
/var/www/html/app/Repositories/Abstracts/AbstractRepos

[Killed] MethodCallRemoval
Repositories/OfferRepository.php:23:9
     public function create(Shop $shop, array $data): Offer
     {
         $offer = $this->newModelInstance()->newQuery()->make($data);
-        $offer->shop()->associate($shop);
+        
         $offer->save();
 
killedBy: Tests\Unit\Repositories\OfferRepositoryTest::testCreate
statusReason: 1) Tests\Unit\Repositories\OfferRepositoryTest::testCreate

/var/www/html/vendor/laravel/framework/src/Illuminate/Database/Connection.php:829
/var/www/html/vendor/laravel/framework/src/Illuminate/Database/Connection.php:783
/var/www/html/vendor/laravel/framework/src/Illuminate/Database/MySqlConnection.php:34
/var/www/html/vendor/laravel/framework/src/Illuminate/Database/Query/Builder.php:3498
/var

[Killed] MethodCallRemoval
Repositories/OfferRepository.php:24:9
     {
         $offer = $this->newModelInstance()->newQuery()->make($data);
         $offer->shop()->associate($shop);
-        $offer->save();
+        
 
         return $offer;
killedBy: Tests\Unit\Repositories\OfferRepositoryTest::testCreate
statusReason: 1) Tests\Unit\Repositories\OfferRepositoryTest::testCreate
Failed asserting that null is not null.

/var/www/html/tests/Unit/Repositories/OfferRepositoryTest.php:44
/var/www/html/vendor/laravel/framework/src/Illuminate/Foundation/Testing/TestCase.php:61

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] ArrayItemRemoval
Repositories/OfferRepository.php:29:5
         return $offer;
     }
 
-    public function findBy(string $column, mixed $attribute, array|string $columns = ['*']): Offer
+    public function findBy(string $column, mixed $attribute, array|string $columns = []): Offer
     {
         return $this->newModelInstance()->newQuery()->where($column, $attribute)->firstOrFail($columns);
killedBy: Tests\Unit\Repositories\OfferRepositoryTest::testFindBy
statusReason: 1) Tests\Unit\Repositories\OfferRepositoryTest::testFindByThrowModelNotFoundException
/var/www/html/vendor/laravel/framework/src/Illuminate/Database/Connection.php:423
/var/www/html/vendor/laravel/framework/src/Illuminate/Database/Connection.php:816
/var/www/html/vendor/laravel/framework/src/Illuminate/Database/Connection.php:783
/var/www/html/vendor/laravel/framework/src/Illuminate/Database/Conne
