[Killed] ArrayItemRemoval
Repositories/ShopRepository.php:24:5
         return $this->newModelInstance()->newQuery()->create($data);
     }
 
-    public function findBy(string $column, mixed $attribute, array|string $columns = ['*']): Shop
+    public function findBy(string $column, mixed $attribute, array|string $columns = []): Shop
     {
         return $this->newModelInstance()->newQuery()->where($column, $attribute)->firstOrFail($columns);
killedBy: Tests\Unit\Repositories\ShopRepositoryTest::testFindBy
statusReason: 1) Tests\Unit\Repositories\ShopRepositoryTest::testFindByThrowModelNotFoundException
/var/www/html/vendor/laravel/framework/src/Illuminate/Database/Connection.php:423
/var/www/html/vendor/laravel/framework/src/Illuminate/Database/Connection.php:816
/var/www/html/vendor/laravel/framework/src/Illuminate/Database/Connection.php:783
/var/www/html/vendor/laravel/framework/src/Illuminate/Database/Connec
